BrutalistInstruments/STHeadlessSequencerFW/DevKitAndUarts.ioc
#MicroXplorer Configuration settings - do not modify
Appli.IPs=GPIO,FLASH,SDMMC1,GPDMA1,HPDMA1,LINKEDLIST,NVIC2\:I,RCC,USB_OTG_FS,USB_OTG_HS,UCPD1,USBPD,CORTEX_M7_APPLI\:I,USART1,UART4,UART5,UART8,DEBUG,UART7,XSPI1,XSPI2
Boot.IPs=GPIO,DEBUG,RCC\:I,GPDMA1\:I,HPDMA1\:I,LINKEDLIST\:I,NVIC1\:I,SBS,SYS\:I,CORTEX_M7_BOOT\:I,SDMMC1,UART7,MEMORYMAP\:I,XSPI2,XSPI1
CAD.formats=[]
CAD.pinconfig=Dual
CAD.provider=
EXTMEM_LOADER.IPParameters=RefParam_SECTORS_NBR,RefParam_SECTORS_SIZE,RefParam_Loader_Name
EXTMEM_LOADER.RefParam_Loader_Name=EXTMEMLOADER_STM32H7S78-DK
EXTMEM_LOADER.RefParam_SECTORS_NBR=2048
EXTMEM_LOADER.RefParam_SECTORS_SIZE=0x10000
EXTMEM_MANAGER.IPParameters=RefParam_MEMORY_1_Instance,RefParam_MEMORY_1_ConfigType,RefParam_MEMORY_2_Driver_Selection,RefParam_MEMORY_2_Size,RefParam_MEMORY_2_NumberOfConfig,RefParam_BOOT_enable
EXTMEM_MANAGER.RefParam_BOOT_enable=true
EXTMEM_MANAGER.RefParam_MEMORY_1_ConfigType=EXTMEM_LINK_CONFIG_8LINES
EXTMEM_MANAGER.RefParam_MEMORY_1_Instance=XSPI2
EXTMEM_MANAGER.RefParam_MEMORY_2_Driver_Selection=EXTMEM_PSRAM
EXTMEM_MANAGER.RefParam_MEMORY_2_NumberOfConfig=1
EXTMEM_MANAGER.RefParam_MEMORY_2_Size=HAL_XSPI_SIZE_32MB
ExtMemLoader.IPs=EXTMEM_LOADER\:I,EXTMEM_MANAGER\:I,GPIO,XSPI2
File.Version=6
GPDMA1.DATAHANDLING_GPDMACH0=NONE
GPDMA1.DIRECTION_GPDMACH1=DMA_MEMORY_TO_PERIPH
GPDMA1.DIRECTION_GPDMACH3=DMA_MEMORY_TO_PERIPH
GPDMA1.DIRECTION_GPDMACH5=DMA_MEMORY_TO_PERIPH
GPDMA1.DIRECTION_GPDMACH7=DMA_MEMORY_TO_PERIPH
GPDMA1.DIRECTION_GPDMACH8=DMA_PERIPH_TO_MEMORY
GPDMA1.DIRECTION_GPDMACH9=DMA_MEMORY_TO_PERIPH
GPDMA1.IPParameters=REQUEST_GPDMACH0,DATAHANDLING_GPDMACH0,REQUEST_GPDMACH1,DIRECTION_GPDMACH1,REQUEST_GPDMACH2,REQUEST_GPDMACH3,DIRECTION_GPDMACH3,REQUEST_GPDMACH4,REQUEST_GPDMACH5,DIRECTION_GPDMACH5,REQUEST_GPDMACH6,REQUEST_GPDMACH7,DIRECTION_GPDMACH7,REQUEST_GPDMACH8,DIRECTION_GPDMACH8,REQUEST_GPDMACH9,DIRECTION_GPDMACH9
GPDMA1.REQUEST_GPDMACH0=GPDMA1_REQUEST_USART1_RX
GPDMA1.REQUEST_GPDMACH1=GPDMA1_REQUEST_USART1_TX
GPDMA1.REQUEST_GPDMACH2=GPDMA1_REQUEST_UART4_RX
GPDMA1.REQUEST_GPDMACH3=GPDMA1_REQUEST_UART4_TX
GPDMA1.REQUEST_GPDMACH4=GPDMA1_REQUEST_UART5_RX
GPDMA1.REQUEST_GPDMACH5=GPDMA1_REQUEST_UART5_TX
GPDMA1.REQUEST_GPDMACH6=GPDMA1_REQUEST_UART7_RX
GPDMA1.REQUEST_GPDMACH7=GPDMA1_REQUEST_UART7_TX
GPDMA1.REQUEST_GPDMACH8=GPDMA1_REQUEST_UART8_RX
GPDMA1.REQUEST_GPDMACH9=GPDMA1_REQUEST_UART8_TX
GPIO.groupedBy=Group By Peripherals
KeepUserPlacement=false
MMTAppReg1.MEMORYMAP.AppRegionName=DTCM
MMTAppReg1.MEMORYMAP.ContextName=Boot
MMTAppReg1.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg1.MEMORYMAP.DefaultDataRegion=true
MMTAppReg1.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name
MMTAppReg1.MEMORYMAP.Name=DTCM
MMTAppReg1.MEMORYMAP.Size=65536
MMTAppReg1.MEMORYMAP.StartAddress=0x20000000
MMTAppReg2.MEMORYMAP.AppRegionName=RAM
MMTAppReg2.MEMORYMAP.ContextName=Boot
MMTAppReg2.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg2.MEMORYMAP.DefaultDataRegion=true
MMTAppReg2.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name
MMTAppReg2.MEMORYMAP.Name=RAM
MMTAppReg2.MEMORYMAP.Size=465920
MMTAppReg2.MEMORYMAP.StartAddress=0x24000000
MMTAppReg3.MEMORYMAP.AppRegionName=ITCM
MMTAppReg3.MEMORYMAP.Cacheability=WTRA
MMTAppReg3.MEMORYMAP.ContextName=Boot
MMTAppReg3.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg3.MEMORYMAP.DefaultDataRegion=false
MMTAppReg3.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,Cacheability
MMTAppReg3.MEMORYMAP.Name=ITCM
MMTAppReg3.MEMORYMAP.Size=65536
MMTAppReg3.MEMORYMAP.StartAddress=0x00000000
MMTAppReg4.MEMORYMAP.AP=RO_priv_only
MMTAppReg4.MEMORYMAP.AppRegionName=FLASH
MMTAppReg4.MEMORYMAP.Cacheability=WTRA
MMTAppReg4.MEMORYMAP.ContextName=Boot
MMTAppReg4.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg4.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg4.MEMORYMAP.DefaultDataRegion=false
MMTAppReg4.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,MemType,ContextName,Name,AP,Cacheability,DefaultCodeRegion
MMTAppReg4.MEMORYMAP.MemType=ROM
MMTAppReg4.MEMORYMAP.Name=FLASH
MMTAppReg4.MEMORYMAP.Size=65536
MMTAppReg4.MEMORYMAP.StartAddress=0x08000000
MMTAppReg5.MEMORYMAP.AppRegionName=DTCM
MMTAppReg5.MEMORYMAP.ContextName=Appli
MMTAppReg5.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg5.MEMORYMAP.DefaultDataRegion=true
MMTAppReg5.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name
MMTAppReg5.MEMORYMAP.Name=DTCM
MMTAppReg5.MEMORYMAP.Size=65536
MMTAppReg5.MEMORYMAP.StartAddress=0x20000000
MMTAppReg6.MEMORYMAP.AppRegionName=RAM
MMTAppReg6.MEMORYMAP.ContextName=Appli
MMTAppReg6.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg6.MEMORYMAP.DefaultDataRegion=true
MMTAppReg6.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name
MMTAppReg6.MEMORYMAP.Name=RAM
MMTAppReg6.MEMORYMAP.Size=465920
MMTAppReg6.MEMORYMAP.StartAddress=0x24000000
MMTAppReg7.MEMORYMAP.AppRegionName=ITCM
MMTAppReg7.MEMORYMAP.Cacheability=WTRA
MMTAppReg7.MEMORYMAP.ContextName=Appli
MMTAppReg7.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg7.MEMORYMAP.DefaultDataRegion=false
MMTAppReg7.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,Cacheability
MMTAppReg7.MEMORYMAP.Name=ITCM
MMTAppReg7.MEMORYMAP.Size=65536
MMTAppReg7.MEMORYMAP.StartAddress=0x00000000
MMTAppReg8.MEMORYMAP.AP=RO_priv_only
MMTAppReg8.MEMORYMAP.AppRegionName=FLASH
MMTAppReg8.MEMORYMAP.Cacheability=WTRA
MMTAppReg8.MEMORYMAP.ContextName=Appli
MMTAppReg8.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg8.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg8.MEMORYMAP.DefaultDataRegion=false
MMTAppReg8.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,MemType,ContextName,Name,AP,Cacheability,DefaultCodeRegion,InvalidRegion
MMTAppReg8.MEMORYMAP.InvalidRegion=true
MMTAppReg8.MEMORYMAP.MemType=NA
MMTAppReg8.MEMORYMAP.Name=FLASH
MMTAppReg8.MEMORYMAP.Size=49152
MMTAppReg8.MEMORYMAP.StartAddress=0x70000000
MMTAppRegionsCount=8
MMTConfigApplied=false
Mcu.CPN=STM32H7S7L8H6H
Mcu.Context0=Boot
Mcu.Context1=Appli
Mcu.Context2=ExtMemLoader
Mcu.ContextNb=3
Mcu.Family=STM32H7
Mcu.IP0=CORTEX_M7_APPLI
Mcu.IP1=CORTEX_M7_BOOT
Mcu.IP10=RCC
Mcu.IP11=SBS
Mcu.IP12=SDMMC1
Mcu.IP13=SYS
Mcu.IP14=UART4
Mcu.IP15=UART5
Mcu.IP16=UART7
Mcu.IP17=UART8
Mcu.IP18=UCPD1
Mcu.IP19=USART1
Mcu.IP2=DEBUG
Mcu.IP20=USB_OTG_FS
Mcu.IP21=USB_OTG_HS
Mcu.IP22=XSPI1
Mcu.IP23=XSPI2
Mcu.IP3=EXTMEM_LOADER
Mcu.IP4=EXTMEM_MANAGER
Mcu.IP5=FLASH
Mcu.IP6=GPDMA1
Mcu.IP7=MEMORYMAP
Mcu.IP8=NVIC2
Mcu.IP9=NVIC1
Mcu.IPNb=24
Mcu.Name=STM32H7S7L8HxH
Mcu.Package=TFBGA225 HEXA SMPS
Mcu.Pin0=PE0
Mcu.Pin1=PM12
Mcu.Pin10=PC11
Mcu.Pin11=PB9
Mcu.Pin12=PE1
Mcu.Pin13=PB3(JTDO/TRACESWO)
Mcu.Pin14=PM13
Mcu.Pin15=PM14
Mcu.Pin16=PM8
Mcu.Pin17=PM1
Mcu.Pin18=PA11
Mcu.Pin19=PC15-OSC32_OUT(OSC32_OUT)
Mcu.Pin2=PM6
Mcu.Pin20=PC14-OSC32_IN(OSC32_IN)
Mcu.Pin21=PB4(NJTRST)
Mcu.Pin22=PM0
Mcu.Pin23=PC12
Mcu.Pin24=PA14(JTCK/SWCLK)
Mcu.Pin25=PA9
Mcu.Pin26=PC8
Mcu.Pin27=PC13
Mcu.Pin28=PA13(JTMS/SWDIO)
Mcu.Pin29=PC9
Mcu.Pin3=PM3
Mcu.Pin30=PG11
Mcu.Pin31=PA8
Mcu.Pin32=PN1
Mcu.Pin33=PA15(JTDI)
Mcu.Pin34=PN3
Mcu.Pin35=PN0
Mcu.Pin36=PN11
Mcu.Pin37=PN10
Mcu.Pin38=PN9
Mcu.Pin39=PN2
Mcu.Pin4=PD2
Mcu.Pin40=PN7
Mcu.Pin41=PN6
Mcu.Pin42=PH0-OSC_IN(PH0)
Mcu.Pin43=PH1-OSC_OUT(PH1)
Mcu.Pin44=PN8
Mcu.Pin45=PN4
Mcu.Pin46=PN5
Mcu.Pin47=PC1
Mcu.Pin48=PA2
Mcu.Pin49=PC4
Mcu.Pin5=PM11
Mcu.Pin50=PB12
Mcu.Pin51=PA7
Mcu.Pin52=PO3
Mcu.Pin53=PP10
Mcu.Pin54=PB15
Mcu.Pin55=PC5
Mcu.Pin56=PP12
Mcu.Pin57=PP14
Mcu.Pin58=PP2
Mcu.Pin59=PP5
Mcu.Pin6=PM9
Mcu.Pin60=PO2
Mcu.Pin61=PP1
Mcu.Pin62=PB13
Mcu.Pin63=PB0
Mcu.Pin64=PP11
Mcu.Pin65=PP15
Mcu.Pin66=PP3
Mcu.Pin67=PO5
Mcu.Pin68=PP0
Mcu.Pin69=PP7
Mcu.Pin7=PM5
Mcu.Pin70=PP8
Mcu.Pin71=PB1
Mcu.Pin72=PP13
Mcu.Pin73=PP4
Mcu.Pin74=PO4
Mcu.Pin75=PP6
Mcu.Pin76=PO0
Mcu.Pin77=PP9
Mcu.Pin78=VP_EXTMEM_LOADER_SIG_Activate_EXTMEM_LOADER
Mcu.Pin79=VP_EXTMEM_MANAGER_SIG_Activate_EXTMEM
Mcu.Pin8=PM2
Mcu.Pin80=VP_FLASH_SIG_Activate_FlashIP
Mcu.Pin81=VP_GPDMA1_VS_GPDMACH0
Mcu.Pin82=VP_GPDMA1_VS_GPDMACH1
Mcu.Pin83=VP_GPDMA1_VS_GPDMACH2
Mcu.Pin84=VP_GPDMA1_VS_GPDMACH3
Mcu.Pin85=VP_GPDMA1_VS_GPDMACH4
Mcu.Pin86=VP_GPDMA1_VS_GPDMACH5
Mcu.Pin87=VP_GPDMA1_VS_GPDMACH6
Mcu.Pin88=VP_GPDMA1_VS_GPDMACH7
Mcu.Pin89=VP_GPDMA1_VS_GPDMACH8
Mcu.Pin9=PC10
Mcu.Pin90=VP_GPDMA1_VS_GPDMACH9
Mcu.Pin91=VP_SBS_VS-SBS
Mcu.Pin92=VP_SYS_VS_Systick
Mcu.Pin93=VP_XSPI1_VS_hexa
Mcu.Pin94=VP_XSPI2_VS_octo
Mcu.Pin95=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.PinsNb=96
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32H7S7L8HxH
MxCube.Version=6.12.0
MxDb.Version=DB.6.0.120
NVIC1.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.ForceEnableDMAVector=true
NVIC1.GPDMA1_Channel6_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC1.GPDMA1_Channel7_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC1.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.ForceEnableDMAVector=true
NVIC2.GPDMA1_Channel0_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.GPDMA1_Channel1_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.GPDMA1_Channel2_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.GPDMA1_Channel3_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.GPDMA1_Channel4_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.GPDMA1_Channel5_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.GPDMA1_Channel6_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.GPDMA1_Channel7_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.GPDMA1_Channel8_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.GPDMA1_Channel9_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA11.GPIOParameters=PinAttribute
PA11.Locked=true
PA11.Mode=Asynchronous
PA11.PinAttribute=Appli
PA11.Signal=UART4_RX
PA13(JTMS/SWDIO).GPIOParameters=GPIO_Label
PA13(JTMS/SWDIO).GPIO_Label=SWDIO
PA13(JTMS/SWDIO).Locked=true
PA13(JTMS/SWDIO).Mode=JTAG_4_pins
PA13(JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PA14(JTCK/SWCLK).GPIOParameters=GPIO_Label
PA14(JTCK/SWCLK).GPIO_Label=SWCLK
PA14(JTCK/SWCLK).Locked=true
PA14(JTCK/SWCLK).Mode=JTAG_4_pins
PA14(JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PA15(JTDI).Locked=true
PA15(JTDI).Mode=JTAG_4_pins
PA15(JTDI).Signal=DEBUG_JTDI
PA2.GPIOParameters=GPIO_Label,PinAttribute
PA2.GPIO_Label=RMII_MDIO
PA2.Locked=true
PA2.Mode=RMII
PA2.PinAttribute=Appli
PA2.Signal=ETH_MDIO
PA7.GPIOParameters=GPIO_Label,PinAttribute
PA7.GPIO_Label=RMII_CRS_DV
PA7.Locked=true
PA7.Mode=RMII
PA7.PinAttribute=Appli
PA7.Signal=ETH_RMII_CRS_DV
PA8.GPIOParameters=PinAttribute
PA8.Locked=true
PA8.Mode=Asynchronous
PA8.PinAttribute=Boot,Appli
PA8.Signal=UART7_RX
PA9.GPIOParameters=PinAttribute
PA9.Locked=true
PA9.Mode=Asynchronous
PA9.PinAttribute=Appli
PA9.Signal=USART1_TX
PB0.GPIOParameters=GPIO_Label,PinAttribute
PB0.GPIO_Label=RMII_TXD0
PB0.Locked=true
PB0.Mode=RMII
PB0.PinAttribute=Appli
PB0.Signal=ETH_RMII_TXD0
PB1.GPIOParameters=GPIO_Label,PinAttribute
PB1.GPIO_Label=RMII_TXD1
PB1.Locked=true
PB1.Mode=RMII
PB1.PinAttribute=Appli
PB1.Signal=ETH_RMII_TXD1
PB12.GPIOParameters=PinAttribute
PB12.Locked=true
PB12.Mode=Asynchronous
PB12.PinAttribute=Appli
PB12.Signal=UART5_RX
PB13.GPIOParameters=PinAttribute
PB13.Locked=true
PB13.Mode=Asynchronous
PB13.PinAttribute=Appli
PB13.Signal=UART5_TX
PB15.GPIOParameters=PinAttribute
PB15.Locked=true
PB15.Mode=Asynchronous
PB15.PinAttribute=Appli
PB15.Signal=USART1_RX
PB3(JTDO/TRACESWO).Mode=JTAG_4_pins
PB3(JTDO/TRACESWO).Signal=DEBUG_JTDO-SWO
PB4(NJTRST).GPIOParameters=PinAttribute
PB4(NJTRST).Mode=Asynchronous
PB4(NJTRST).PinAttribute=Boot,Appli
PB4(NJTRST).Signal=UART7_TX
PB9.GPIOParameters=PinAttribute
PB9.Locked=true
PB9.Mode=Asynchronous
PB9.PinAttribute=Appli
PB9.Signal=UART4_TX
PC1.GPIOParameters=GPIO_Label,PinAttribute
PC1.GPIO_Label=RMII_MDC
PC1.Locked=true
PC1.Mode=RMII
PC1.PinAttribute=Appli
PC1.Signal=ETH_MDC
PC10.GPIOParameters=GPIO_Label,PinAttribute
PC10.GPIO_Label=SD_D2
PC10.Locked=true
PC10.Mode=SD_4_bits_Wide_bus
PC10.PinAttribute=Boot,Appli
PC10.Signal=SDMMC1_D2
PC11.GPIOParameters=GPIO_Label,PinAttribute
PC11.GPIO_Label=SD_D3
PC11.Locked=true
PC11.Mode=SD_4_bits_Wide_bus
PC11.PinAttribute=Boot,Appli
PC11.Signal=SDMMC1_D3
PC12.GPIOParameters=GPIO_Label,PinAttribute
PC12.GPIO_Label=SD_CK
PC12.Locked=true
PC12.Mode=SD_4_bits_Wide_bus
PC12.PinAttribute=Boot,Appli
PC12.Signal=SDMMC1_CK
PC13.GPIOParameters=GPIO_Label,PinAttribute
PC13.GPIO_Label=USER
PC13.Locked=true
PC13.PinAttribute=Free
PC13.Signal=GPXTI13
PC14-OSC32_IN(OSC32_IN).GPIOParameters=GPIO_Label
PC14-OSC32_IN(OSC32_IN).GPIO_Label=OSC32_IN
PC14-OSC32_IN(OSC32_IN).Locked=true
PC14-OSC32_IN(OSC32_IN).Mode=LSE-External-Oscillator
PC14-OSC32_IN(OSC32_IN).Signal=RCC_OSC32_IN
PC15-OSC32_OUT(OSC32_OUT).GPIOParameters=GPIO_Label
PC15-OSC32_OUT(OSC32_OUT).GPIO_Label=OSC32_OUT
PC15-OSC32_OUT(OSC32_OUT).Locked=true
PC15-OSC32_OUT(OSC32_OUT).Mode=LSE-External-Oscillator
PC15-OSC32_OUT(OSC32_OUT).Signal=RCC_OSC32_OUT
PC4.GPIOParameters=GPIO_Label,PinAttribute
PC4.GPIO_Label=RMII_RXD0
PC4.Locked=true
PC4.Mode=RMII
PC4.PinAttribute=Appli
PC4.Signal=ETH_RMII_RXD0
PC5.GPIOParameters=GPIO_Label,PinAttribute
PC5.GPIO_Label=RMII_RXD1
PC5.Locked=true
PC5.Mode=RMII
PC5.PinAttribute=Appli
PC5.Signal=ETH_RMII_RXD1
PC8.GPIOParameters=GPIO_Label,PinAttribute
PC8.GPIO_Label=SD_D0
PC8.Locked=true
PC8.Mode=SD_4_bits_Wide_bus
PC8.PinAttribute=Boot,Appli
PC8.Signal=SDMMC1_D0
PC9.GPIOParameters=GPIO_Label,PinAttribute
PC9.GPIO_Label=SD_D1
PC9.Locked=true
PC9.Mode=SD_4_bits_Wide_bus
PC9.PinAttribute=Boot,Appli
PC9.Signal=SDMMC1_D1
PD2.GPIOParameters=GPIO_Label,PinAttribute
PD2.GPIO_Label=SD_CMD
PD2.Locked=true
PD2.Mode=SD_4_bits_Wide_bus
PD2.PinAttribute=Boot,Appli
PD2.Signal=SDMMC1_CMD
PE0.GPIOParameters=PinAttribute
PE0.Locked=true
PE0.Mode=Asynchronous
PE0.PinAttribute=Appli
PE0.Signal=UART8_RX
PE1.GPIOParameters=PinAttribute
PE1.Locked=true
PE1.Mode=Asynchronous
PE1.PinAttribute=Appli
PE1.Signal=UART8_TX
PG11.GPIOParameters=GPIO_Label,PinAttribute
PG11.GPIO_Label=RMII_TX_EN
PG11.Locked=true
PG11.Mode=RMII
PG11.PinAttribute=Appli
PG11.Signal=ETH_RMII_TX_EN
PH0-OSC_IN(PH0).GPIOParameters=GPIO_Label
PH0-OSC_IN(PH0).GPIO_Label=OSC_IN
PH0-OSC_IN(PH0).Locked=true
PH0-OSC_IN(PH0).Mode=HSE-External-Oscillator
PH0-OSC_IN(PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT(PH1).Locked=true
PH1-OSC_OUT(PH1).Mode=HSE-External-Oscillator
PH1-OSC_OUT(PH1).Signal=RCC_OSC_OUT
PM0.GPIOParameters=GPIO_Label,PinAttribute
PM0.GPIO_Label=UCPD1_CC1
PM0.Locked=true
PM0.Mode=Dual_Role_AllSignals
PM0.PinAttribute=Appli
PM0.Signal=UCPD1_CC1
PM1.GPIOParameters=GPIO_Label,PinAttribute
PM1.GPIO_Label=UCPD1_CC2
PM1.Locked=true
PM1.Mode=Dual_Role_AllSignals
PM1.PinAttribute=Appli
PM1.Signal=UCPD1_CC2
PM11.GPIOParameters=GPIO_Label,PinAttribute
PM11.GPIO_Label=USB2_FS_P
PM11.Locked=true
PM11.Mode=Device_Only
PM11.PinAttribute=Appli
PM11.Signal=USB_OTG_FS_DP
PM12.GPIOParameters=GPIO_Label,PinAttribute
PM12.GPIO_Label=USB2_FS_N
PM12.Locked=true
PM12.Mode=Device_Only
PM12.PinAttribute=Appli
PM12.Signal=USB_OTG_FS_DM
PM13.GPIOParameters=GPIO_Label,PinAttribute
PM13.GPIO_Label=Audio_RSTn
PM13.Locked=true
PM13.PinAttribute=Free
PM13.Signal=GPIO_Output
PM14.GPIOParameters=GPIO_Label,PinAttribute
PM14.GPIO_Label=SD_DETECT
PM14.Locked=true
PM14.PinAttribute=Free
PM14.Signal=GPXTI14
PM2.GPIOParameters=GPIO_Label,PinAttribute
PM2.GPIO_Label=LD3
PM2.Locked=true
PM2.PinAttribute=Free
PM2.Signal=GPIO_Output
PM3.GPIOParameters=GPIO_Label,PinAttribute
PM3.GPIO_Label=LD4
PM3.Locked=true
PM3.PinAttribute=Free
PM3.Signal=GPIO_Output
PM5.GPIOParameters=GPIO_Label,PinAttribute
PM5.GPIO_Label=USB1_HS_N
PM5.Locked=true
PM5.Mode=Internal_Phy_Host
PM5.PinAttribute=Appli
PM5.Signal=USB_OTG_HS_DM
PM6.GPIOParameters=GPIO_Label,PinAttribute
PM6.GPIO_Label=USB1_HS_P
PM6.Locked=true
PM6.Mode=Internal_Phy_Host
PM6.PinAttribute=Appli
PM6.Signal=USB_OTG_HS_DP
PM8.GPIOParameters=GPIO_Label,PinAttribute
PM8.GPIO_Label=UCPD1_INT
PM8.Locked=true
PM8.PinAttribute=Free
PM8.Signal=GPXTI8
PM9.GPIOParameters=GPIO_Label,PinAttribute
PM9.GPIO_Label=UCPD1_PWR_EN
PM9.Locked=true
PM9.PinAttribute=Free
PM9.Signal=GPIO_Output
PN0.GPIOParameters=GPIO_Label,PinAttribute
PN0.GPIO_Label=OCTOSPI_DQS
PN0.Locked=true
PN0.Mode=XSPI2_Port2Octo
PN0.PinAttribute=Boot,Appli,ExtMemLoader
PN0.Signal=XSPIM_P2_DQS0
PN1.GPIOParameters=PinAttribute
PN1.Mode=XSPI2_NCS1_Port2
PN1.PinAttribute=Boot,Appli,ExtMemLoader
PN1.Signal=XSPIM_P2_NCS1
PN10.GPIOParameters=GPIO_Label,PinAttribute
PN10.GPIO_Label=OCTOSPI_IO6
PN10.Locked=true
PN10.Mode=XSPI2_Port2Octo
PN10.PinAttribute=Boot,Appli,ExtMemLoader
PN10.Signal=XSPIM_P2_IO6
PN11.GPIOParameters=GPIO_Label,PinAttribute
PN11.GPIO_Label=OCTOSPI_IO7
PN11.Locked=true
PN11.Mode=XSPI2_Port2Octo
